{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"description":5,"content":6,"visible":7,"tags":8},"gsoc24","My GSoC'24 Journey with eunomia-bpf","2024-07-21","Sharing my experience and learnings from Google Summer of Code 2024 with eunomia-bpf","\n# My GSoC'24 Journey with eunomia-bpf\n\nI'm excited to share my experience as a Google Summer of Code contributor at eunomia-bpf. In this blog post, I'll walk through my journey, the challenges I faced, and what I learned along the way.\n\n## About eunomia-bpf\n\n[eunomia-bpf](https://eunomia.dev/) is an innovative project that brings eBPF technology to userspace. What makes it particularly interesting is that eBPF, traditionally a kernel-space technology, is now accessible in userspace through their runtime implementation.\n\n## My Contribution\n\nDuring my GSoC period, I worked on [describe your specific project/contribution]. Some key highlights include:\n\n- bpftime can be compiled on macOS system with feature flags \n- Added tests for functionalities that weren't there before \n- Made registers architecture agnostic \n\n## Technical Challenges\n\nSome of the interesting technical challenges I encountered were:\n\n1. Testing:\n - I didn't have any non-macOS system with me so testing those changes was very difficult, even setting it up with UTM(QEMU) was not that fast. Once changes were done they needed to be synced with the code in my UTM system and then see the feedback\n2. No support of libraries like libelf and libbpf on MacOS meant adding these libraries as your own header files\n\n## What I Learned\n\nThis experience has taught me a lot about:\n\n- Working with eBPF technology\n- Contributing to open source\n- Collaborating with a global team\n\n## Future Plans\n\nMoving forward, I plan to:\n\n- Continue contributing to eunomia-bpf\n- Explore more aspects of systems programming\n- Share my knowledge with the community\n\n## Conclusion\n\nGSoC has been an incredible learning experience. I'm grateful for the opportunity to work with the eunomia-bpf team and contribute to such an innovative project.\n\nFeel free to check out my contributions on [GitHub](https://github.com/eunomia-bpf/bpftime) and reach out if you have any questions about my GSoC experience!\n",true,[9,10],"GSoC","blog"],"uses":{"params":["slug"]}}]}
