{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"description":5,"content":6,"visible":7,"tags":8},"outing-near-a-lakehouse","Outing near a lakehouse","2025-05-13","what I learned about Datawarehouses, Delta-lakes and Lakehouses","This sunday there was an interesting meetup organized by `e6data(https://www.e6data.com/)`, called Lakehouse days(https://lu.ma/m593968s?tk=5dBS7S).\nTheme for this week was around `Apache Iceberg` before coming to this meetup, I had only heard of `Datawarehouses`, `Delta lakes` and `Lakehouses` courtesy reading some parts of `Apache Iceberg: The definitive Guide`(https://www.amazon.in/Apache-Iceberg-Functionality-Performance-Scalability/dp/1098148622).\nI went in with an open mind, to learn more about this ecosystem, to really understand how those terms are defined and used in Industry.\nFirst talk was titled `Design a lakehouse brick by brick using pyarrow, pyberg & DuckDB`\n\nIt was pretty interesting, really cleared up a lot of things for me before jumping into details of DWH, Delta Lake & Lakehouse, I would like to talk about Data platforms.\n\nData platforms consist of following:\n- Storage (Cloud/Disk)\n- File formats (Parquet, Avro, ORC)\n- Table format (Apache Iceberg)\n- Storage engine\n- Compute engine (e6data is one example) \n- Catalog \n\n### **Storage**\nIt is basically where your data resides, it can be in a disk or in object storage.\n\n### **File formats**\nThese are formats in which data are stored, storing data the way it is received will be very space inefficient and will be difficult\nin certain operations.\n\n### **Table formats**\nThese are formats to make your data files queryable with some language, it can be SQL or something else, Apache Hive was the first\nto provide one interface on top of HDFS(Hadoop File System).\n\n### **Storage engine**\nThese are what controls the flow of data, like which page to put data into and how to store, everything is handled by these, they are an abstraction over filesystem.\n\n### **Compute engine**\nProcessing data files & table formats is done with the help of compute engine, some famous ones are like `Apache Spark`, `DuckDB`, `Apache Flink` and many more.\n\n### **Catalog**\nStoring metadata about different components of your data and \n\nDatawarehouses, Delta Lakes & Lakehouses all have these components, difference lies in how these components are assembled.\n\nIn a Datawarehouse, data is pretty structured and all the components are well packaged into one software component. As a user you\nare stuck with one solution and if you want to try some new File format or add a new table format to your data, you will have to\nswitch your DB, Another issue with DWH is that they are not good in storing unstructured data, in production systems, there is \nalways an ETL(Extract-Transform-Load) step before data is added into these DBs.\n\nDelta Lakes provide one step better clarity and support unstructured or semi-structured data but they also lack the modularity \n",false,[9,10],"Database","blog"],"uses":{"params":["slug"]}}]}
