{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"description":5,"content":6,"visible":7,"tags":8},"installing-clickhouse-fixing-a-macos-issue","Fixing a MacOS issue while installing Clickhouse","2025-05-13","how a OS library update can break your DB","\nSo, Yesterday I was installing clickhouse from source on my system(macbook air M2), I am glad that `Clickhouse` has a very good\ndocumentation on their site for this purpose.\nI referred to it but I was facing an issue whenever I was doing\n```\ncmake --build build\n```\nError was something that `strchrnul` is redefined, previously it was defined in `MacOSX15.4` system libraries and then it was again \ndefined in some postgres header file, I checked github to find out if there is any open issue on this. I found one issue but it was closed:\nhttps://github.com/ClickHouse/ClickHouse/issues/78804\n\nIn the issue comments it was mentioned that clang version is not supported, maybe because the author had specifically mentioned \n`clang 17.0.0` and `Clickhouse` only works on `clang 19` and that too non-apple one.\nOur errors were similar though, so that prompted me to look up more on this issue and I got to know from a LLM that there is\na issue discovered in Postgres on this: \nhttps://www.postgresql.org/message-id/flat/407464.1743535559%40sss.pgh.pa.us#277a94029172f7d3de0048d46474ebf0\n\nI checked the `cmake` file for `Postgres` and there was already a check regarding this. I wondered why then my build was failing.\n\nI ran the command which was checking the version for my system, it was `xcrun --sdk macosx --show-sdk-version`. This command was returning me `15.2` but I checked in my error logs, library version which was being used was `15.4`. \n\nBecause `xcrun` was returning a lower version, the cmake check was failing and `strchrnul` was also included, it wouldn't have failed\nif we were getting `15.4`. \n\nI changed the way version was checked and re-ran the build commands, voila it worked.\n\nI submitted my PR: https://github.com/ClickHouse/ClickHouse/pull/80228/files\n\nIt was interesting to know that how much an OS can change the stability of a system. MacOSX didn't come with their own `strchrnul` but in latest versions they are defining a constant for that.\n\nPostgres had it declared when they were creating their software and now their changes were breaking. It was a nice reminder that unless you own everything in the stack, you can't be sure when and where your software can break.\n\n",false,[9,10],"Database","blog"],"uses":{"params":["slug"]}}]}
