{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"description":5,"content":6,"visible":7,"tags":8},"adding-frm-parser-part-1","Adding a FRM parser to MariaDB","2025-06-23","A GSoC project","\nIn one of my previous posts, I had described my journey of how I compiled `MariaDB` on MacOS. It was a struggle and a lot of back and forth but in the process, I learnt about some dependencies that aren't really necessary to compile and run `MariaDB`. In this \nblog post, I will be talking about `.frm` (form) files and a parser that I am writing as part of this Google summer of Code.\n\nGoogle Summer of Code is in motion, with this being a pen-ultimate week before mid evaluations, I am currently contributing in this\nproject (https://summerofcode.withgoogle.com/programs/2025/projects/vAVydntH).\n\nIn Community bonding period, members of MariaDB community had setup a call where we introduced ourselves and got to know about our mentors. Post that I connected with my mentors separately and they told me how I can approach this problem. I had researched at my end about the `.frm` files and where they are used in the `MariaDB`.\n\nThrough some jira comments mentioned on the raised issue(https://jira.mariadb.org/browse/MDEV-4637). In the comments, Sergei Golubchik describes how we can simply replace the data structures with `printf` and we can have a simple parser. I had thought of the similar approach. After my conversation with my mentors, Nikita Malyavin and Oleksandr Sanja Byelkin, we made this approach concrete, My first task was to create a separate utility which simply compile the `init_from_binary_frm_image` and works. \n\nI was given the KT on the process and different data structures by Nikita Malyavin and Oleksandr \"Sanja\" Byelkin in the discussion call, there I learnt about different `handlers` that are being used and the data structures like `THD`, `TABLE`, `TABLE_SHARE`.\n\nIn my time, I searched around the format of form files and different tools that are already there in the wild, one particular blog\nthat I came across and found helpful was this: https://dbsake.readthedocs.io/en/latest/appendix/frm_format.html#frm-format\nBut it was better to trust the implementation in the `init_from_binary_frm_image` function which is defined in `table.cc` \n\n`TABLE_SHARE::init_from_binary_frm_image`\n\n\n\nCurrently when MariaDB starts we have \n\n---- \n\n## References\n\n- [MariaDB official Docs](https://mariadb.org/get-involved/getting-started-for-developers/get-code-build-test/)\n- [ChatGPT](https://chatgpt.com/)\n- [CFI directives](https://sourceware.org/binutils/docs/as/CFI-directives.html)\n- [Configuration option](https://mariadb.com/kb/en/configuring-mariadb-with-option-files/)\n- [Understanding MySQL internals](https://www.amazon.in/Understanding-MySQL-Internals-Sasha-Pachev/dp/0596009577)\n",false,[9,10,11],"database","mariaDB","C++"],"uses":{"params":["slug"]}}]}
